## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for sandboxy environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"] will be updated in-place
  ~ resource "kubectl_manifest" "cdi_operator" {
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"
        name                    = "cdis.cdi.kubevirt.io"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for cluster-api environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0] will be created
  + resource "kubernetes_manifest" "letsencrypt_issuer" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + name = "letsencrypt-prod"
            }
          + spec       = {
              + acme = {
                  + email               = "pedropilla@gmail.com"
                  + privateKeySecretRef = {
                      + name = "letsencrypt-prod"
                    }
                  + server              = "https://acme-v02.api.letsencrypt.org/directory"
                  + solvers             = [
                      + {
                          + dns01 = {
                              + cloudflare = {
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token"
                                    }
                                  + email             = "pedropilla@gmail.com"
                                }
                            }
                        },
                    ]
                }
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "letsencrypt-prod"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + acme       = {
                  + caBundle                    = (known after apply)
                  + disableAccountKeyGeneration = (known after apply)
                  + email                       = "pedropilla@gmail.com"
                  + enableDurationFeature       = (known after apply)
                  + externalAccountBinding      = {
                      + keyAlgorithm = (known after apply)
                      + keyID        = (known after apply)
                      + keySecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + preferredChain              = (known after apply)
                  + privateKeySecretRef         = {
                      + key  = (known after apply)
                      + name = "letsencrypt-prod"
                    }
                  + server                      = "https://acme-v02.api.letsencrypt.org/directory"
                  + skipTLSVerify               = (known after apply)
                  + solvers                     = [
                      + {
                          + dns01    = {
                              + acmeDNS       = {
                                  + accountSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + host             = (known after apply)
                                }
                              + akamai        = {
                                  + accessTokenSecretRef  = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + clientSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + clientTokenSecretRef  = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + serviceConsumerDomain = (known after apply)
                                }
                              + azureDNS      = {
                                  + clientID              = (known after apply)
                                  + clientSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + environment           = (known after apply)
                                  + hostedZoneName        = (known after apply)
                                  + managedIdentity       = {
                                      + clientID   = (known after apply)
                                      + resourceID = (known after apply)
                                    }
                                  + resourceGroupName     = (known after apply)
                                  + subscriptionID        = (known after apply)
                                  + tenantID              = (known after apply)
                                }
                              + cloudDNS      = {
                                  + hostedZoneName          = (known after apply)
                                  + project                 = (known after apply)
                                  + serviceAccountSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + cloudflare    = {
                                  + apiKeySecretRef   = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token"
                                    }
                                  + email             = "pedropilla@gmail.com"
                                }
                              + cnameStrategy = (known after apply)
                              + digitalocean  = {
                                  + tokenSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + rfc2136       = {
                                  + nameserver          = (known after apply)
                                  + tsigAlgorithm       = (known after apply)
                                  + tsigKeyName         = (known after apply)
                                  + tsigSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + route53       = {
                                  + accessKeyID              = (known after apply)
                                  + accessKeyIDSecretRef     = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + auth                     = {
                                      + kubernetes = {
                                          + serviceAccountRef = {
                                              + audiences = (known after apply)
                                              + name      = (known after apply)
                                            }
                                        }
                                    }
                                  + hostedZoneID             = (known after apply)
                                  + region                   = (known after apply)
                                  + role                     = (known after apply)
                                  + secretAccessKeySecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + webhook       = {
                                  + config     = (known after apply)
                                  + groupName  = (known after apply)
                                  + solverName = (known after apply)
                                }
                            }
                          + http01   = {
                              + gatewayHTTPRoute = {
                                  + labels      = (known after apply)
                                  + parentRefs  = (known after apply)
                                  + podTemplate = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                      + spec     = {
                                          + affinity           = {
                                              + nodeAffinity    = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      + nodeSelectorTerms = (known after apply)
                                                    }
                                                }
                                              + podAffinity     = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                              + podAntiAffinity = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                            }
                                          + imagePullSecrets   = (known after apply)
                                          + nodeSelector       = (known after apply)
                                          + priorityClassName  = (known after apply)
                                          + securityContext    = {
                                              + fsGroup             = (known after apply)
                                              + fsGroupChangePolicy = (known after apply)
                                              + runAsGroup          = (known after apply)
                                              + runAsNonRoot        = (known after apply)
                                              + runAsUser           = (known after apply)
                                              + seLinuxOptions      = {
                                                  + level = (known after apply)
                                                  + role  = (known after apply)
                                                  + type  = (known after apply)
                                                  + user  = (known after apply)
                                                }
                                              + seccompProfile      = {
                                                  + localhostProfile = (known after apply)
                                                  + type             = (known after apply)
                                                }
                                              + supplementalGroups  = (known after apply)
                                              + sysctls             = (known after apply)
                                            }
                                          + serviceAccountName = (known after apply)
                                          + tolerations        = (known after apply)
                                        }
                                    }
                                  + serviceType = (known after apply)
                                }
                              + ingress          = {
                                  + class            = (known after apply)
                                  + ingressClassName = (known after apply)
                                  + ingressTemplate  = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                    }
                                  + name             = (known after apply)
                                  + podTemplate      = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                      + spec     = {
                                          + affinity           = {
                                              + nodeAffinity    = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      + nodeSelectorTerms = (known after apply)
                                                    }
                                                }
                                              + podAffinity     = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                              + podAntiAffinity = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                            }
                                          + imagePullSecrets   = (known after apply)
                                          + nodeSelector       = (known after apply)
                                          + priorityClassName  = (known after apply)
                                          + securityContext    = {
                                              + fsGroup             = (known after apply)
                                              + fsGroupChangePolicy = (known after apply)
                                              + runAsGroup          = (known after apply)
                                              + runAsNonRoot        = (known after apply)
                                              + runAsUser           = (known after apply)
                                              + seLinuxOptions      = {
                                                  + level = (known after apply)
                                                  + role  = (known after apply)
                                                  + type  = (known after apply)
                                                  + user  = (known after apply)
                                                }
                                              + seccompProfile      = {
                                                  + localhostProfile = (known after apply)
                                                  + type             = (known after apply)
                                                }
                                              + supplementalGroups  = (known after apply)
                                              + sysctls             = (known after apply)
                                            }
                                          + serviceAccountName = (known after apply)
                                          + tolerations        = (known after apply)
                                        }
                                    }
                                  + serviceType      = (known after apply)
                                }
                            }
                          + selector = {
                              + dnsNames    = (known after apply)
                              + dnsZones    = (known after apply)
                              + matchLabels = (known after apply)
                            }
                        },
                    ]
                }
              + ca         = {
                  + crlDistributionPoints  = (known after apply)
                  + issuingCertificateURLs = (known after apply)
                  + ocspServers            = (known after apply)
                  + secretName             = (known after apply)
                }
              + selfSigned = {
                  + crlDistributionPoints = (known after apply)
                }
              + vault      = {
                  + auth                = {
                      + appRole           = {
                          + path      = (known after apply)
                          + roleId    = (known after apply)
                          + secretRef = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                        }
                      + clientCertificate = {
                          + mountPath  = (known after apply)
                          + name       = (known after apply)
                          + secretName = (known after apply)
                        }
                      + kubernetes        = {
                          + mountPath         = (known after apply)
                          + role              = (known after apply)
                          + secretRef         = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                          + serviceAccountRef = {
                              + audiences = (known after apply)
                              + name      = (known after apply)
                            }
                        }
                      + tokenSecretRef    = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + caBundle            = (known after apply)
                  + caBundleSecretRef   = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + clientCertSecretRef = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + clientKeySecretRef  = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + namespace           = (known after apply)
                  + path                = (known after apply)
                  + server              = (known after apply)
                }
              + venafi     = {
                  + cloud = {
                      + apiTokenSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + url               = (known after apply)
                    }
                  + tpp   = {
                      + caBundle          = (known after apply)
                      + caBundleSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + credentialsRef    = {
                          + name = (known after apply)
                        }
                      + url               = (known after apply)
                    }
                  + zone  = (known after apply)
                }
            }
        }
    }

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be created
  + resource "kubernetes_manifest" "cluster_secrets" {
      + manifest = {
          + apiVersion = "external-secrets.io/v1beta1"
          + kind       = "ClusterExternalSecret"
          + metadata   = {
              + name = "cluster-secrets"
            }
          + spec       = {
              + externalSecretName = "cluster-secrets-es"
              + externalSecretSpec = {
                  + data            = [
                      + {
                          + remoteRef = {
                              + key      = "AWS_ACCESS_KEY_ID"
                              + property = "data.AWS_ACCESS_KEY_ID"
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                        },
                      + {
                          + remoteRef = {
                              + key      = "AWS_SECRET_ACCESS_KEY"
                              + property = "data.AWS_SECRET_ACCESS_KEY"
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + property = "data.PIHOLE_PASSWORD"
                            }
                          + secretKey = "PIHOLE_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "GITLAB_TOKEN"
                              + property = "data.GITLAB_TOKEN"
                            }
                          + secretKey = "GITLAB_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "HARBOR_KEY"
                              + property = "data.HARBOR_KEY"
                            }
                          + secretKey = "HARBOR_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "ISTIO_PRIMARY_CA"
                              + property = "data.ISTIO_PRIMARY_CA"
                            }
                          + secretKey = "ISTIO_PRIMARY_CA"
                        },
                      + {
                          + remoteRef = {
                              + key      = "KUBECONFIG"
                              + property = "data.KUBECONFIG"
                            }
                          + secretKey = "KUBECONFIG"
                        },
                      + {
                          + remoteRef = {
                              + key      = "MINIO"
                              + property = "data.rootPassword"
                            }
                          + secretKey = "rootPassword"
                        },
                      + {
                          + remoteRef = {
                              + key      = "MINIO"
                              + property = "data.rootUser"
                            }
                          + secretKey = "rootUser"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.DATA"
                            }
                          + secretKey = "DATA"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_DATABASE"
                            }
                          + secretKey = "POSTGRES_DATABASE"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_HOST"
                            }
                          + secretKey = "POSTGRES_HOST"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_PASSWORD"
                            }
                          + secretKey = "POSTGRES_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_PORT"
                            }
                          + secretKey = "POSTGRES_PORT"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_USER"
                            }
                          + secretKey = "POSTGRES_USER"
                        },
                      + {
                          + remoteRef = {
                              + key      = "REDIS"
                              + property = "data.REDIS_PASSWORD"
                            }
                          + secretKey = "REDIS_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SOPS"
                              + property = "data.SOPS"
                            }
                          + secretKey = "SOPS"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SSH_PRIVATE_KEY"
                              + property = "data.SSH_PRIVATE_KEY"
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_PROXMOX_PASSWORD"
                              + property = "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_VAULT_TOKEN"
                              + property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_kubeconfig_path"
                              + property = "data.TF_VAR_kubeconfig_path"
                            }
                          + secretKey = "TF_VAR_kubeconfig_path"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_pm_api_token_id"
                              + property = "data.TF_VAR_pm_api_token_id"
                            }
                          + secretKey = "TF_VAR_pm_api_token_id"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_pm_api_token_secret"
                              + property = "data.TF_VAR_pm_api_token_secret"
                            }
                          + secretKey = "TF_VAR_pm_api_token_secret"
                        },
                      + {
                          + remoteRef = {
                              + key      = "VAULT_TOKEN"
                              + property = "data.VAULT_TOKEN"
                            }
                          + secretKey = "VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "github_token"
                              + property = "data.github_token"
                            }
                          + secretKey = "github_token"
                        },
                    ]
                  + refreshInterval = "1m"
                  + secretStoreRef  = {
                      + kind = "ClusterSecretStore"
                      + name = "vault-backend"
                    }
                  + target          = {
                      + name = "cluster-secrets"
                    }
                }
              + namespaceSelector  = {
                  + matchLabels = {
                      + cluster-secrets = "true"
                    }
                }
              + refreshTime        = "1m"
            }
        }
      + object   = {
          + apiVersion = "external-secrets.io/v1beta1"
          + kind       = "ClusterExternalSecret"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "cluster-secrets"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + externalSecretMetadata = {
                  + annotations = (known after apply)
                  + labels      = (known after apply)
                }
              + externalSecretName     = "cluster-secrets-es"
              + externalSecretSpec     = {
                  + data            = [
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_ACCESS_KEY_ID"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_ACCESS_KEY_ID"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_SECRET_ACCESS_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_SECRET_ACCESS_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.PIHOLE_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "PIHOLE_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "GITLAB_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.GITLAB_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "GITLAB_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "HARBOR_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.HARBOR_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "HARBOR_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "ISTIO_PRIMARY_CA"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.ISTIO_PRIMARY_CA"
                              + version            = (known after apply)
                            }
                          + secretKey = "ISTIO_PRIMARY_CA"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "KUBECONFIG"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.KUBECONFIG"
                              + version            = (known after apply)
                            }
                          + secretKey = "KUBECONFIG"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "MINIO"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.rootPassword"
                              + version            = (known after apply)
                            }
                          + secretKey = "rootPassword"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "MINIO"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.rootUser"
                              + version            = (known after apply)
                            }
                          + secretKey = "rootUser"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.DATA"
                              + version            = (known after apply)
                            }
                          + secretKey = "DATA"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_DATABASE"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_DATABASE"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_HOST"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_HOST"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_PORT"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_PORT"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_USER"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_USER"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "REDIS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.REDIS_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "REDIS_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SOPS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SOPS"
                              + version            = (known after apply)
                            }
                          + secretKey = "SOPS"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SSH_PRIVATE_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SSH_PRIVATE_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_PROXMOX_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_PROXMOX_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_kubeconfig_path"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_kubeconfig_path"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_kubeconfig_path"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_pm_api_token_id"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_pm_api_token_id"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_pm_api_token_id"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_pm_api_token_secret"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_pm_api_token_secret"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_pm_api_token_secret"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "github_token"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.github_token"
                              + version            = (known after apply)
                            }
                          + secretKey = "github_token"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                  + dataFrom        = (known after apply)
                  + refreshInterval = "1m"
                  + secretStoreRef  = {
                      + kind = "ClusterSecretStore"
                      + name = "vault-backend"
                    }
                  + target          = {
                      + creationPolicy = (known after apply)
                      + deletionPolicy = (known after apply)
                      + immutable      = (known after apply)
                      + name           = "cluster-secrets"
                      + template       = {
                          + data          = (known after apply)
                          + engineVersion = (known after apply)
                          + mergePolicy   = (known after apply)
                          + metadata      = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + templateFrom  = (known after apply)
                          + type          = (known after apply)
                        }
                    }
                }

... Output truncated due to size. See artifacts for full plan.
  ```
  
  Plan exit code: 0
  